OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020x6.h
#define RCC_APBENR1_UART2EN_Pos          (18U)
#define RCC_APBENR1_UART2EN_Msk          (0x1UL << RCC_APBENR1_UART2EN_Pos)     /*!< 0x00040000 */
#define RCC_APBENR1_UART2EN              RCC_APBENR1_UART2EN_Msk                /*!< UART2 clock enable */

#define RCC_APBENR1_I2CEN_Pos            (21U)
#define RCC_APBENR1_I2CEN_Msk            (0x1UL << RCC_APBENR1_I2CEN_Pos)       /*!< 0x00200000 */
#define RCC_APBENR1_I2CEN                RCC_APBENR1_I2CEN_Msk                  /*!< I2C clock enable */

#define RCC_APBENR1_DBGEN_Pos            (27U)
#define RCC_APBENR1_DBGEN_Msk            (0x1UL << RCC_APBENR1_DBGEN_Pos)       /*!< 0x08000000 */
#define RCC_APBENR1_DBGEN                RCC_APBENR1_DBGEN_Msk                  /*!< DBG clock enable */

#define RCC_APBENR1_PWREN_Pos            (28U)
#define RCC_APBENR1_PWREN_Msk            (0x1UL << RCC_APBENR1_PWREN_Pos)       /*!< 0x10000000 */
#define RCC_APBENR1_PWREN                RCC_APBENR1_PWREN_Msk                  /*!< PWR clock enable */

/********************  Bit definition for RCC_APBENR2 register  **************/
#define RCC_APBENR2_SYSCFGEN_Pos         (0U)
#define RCC_APBENR2_SYSCFGEN_Msk         (0x1UL << RCC_APBENR2_SYSCFGEN_Pos)    /*!< 0x00000001 */
#define RCC_APBENR2_SYSCFGEN             RCC_APBENR2_SYSCFGEN_Msk               /*!< SYSCFG clock enable */

#define RCC_APBENR2_TIM1EN_Pos           (11U)
#define RCC_APBENR2_TIM1EN_Msk           (0x1UL << RCC_APBENR2_TIM1EN_Pos)      /*!< 0x00000800 */
#define RCC_APBENR2_TIM1EN               RCC_APBENR2_TIM1EN_Msk                 /*!< TIM1 clock enable */

#define RCC_APBENR2_SPI1EN_Pos           (12U)
#define RCC_APBENR2_SPI1EN_Msk           (0x1UL << RCC_APBENR2_SPI1EN_Pos)      /*!< 0x00001000 */
#define RCC_APBENR2_SPI1EN               RCC_APBENR2_SPI1EN_Msk                 /*!< SPI clock enable */

#define RCC_APBENR2_UART3EN_Pos          (13U)
#define RCC_APBENR2_UART3EN_Msk          (0x1UL << RCC_APBENR2_UART3EN_Pos)     /*!< 0x00002000 */
#define RCC_APBENR2_UART3EN              RCC_APBENR2_UART3EN_Msk                /*!< UART3 clock enable */

#define RCC_APBENR2_TIM14EN_Pos          (15U)
#define RCC_APBENR2_TIM14EN_Msk          (0x1UL << RCC_APBENR2_TIM14EN_Pos)     /*!< 0x00008000 */
#define RCC_APBENR2_TIM14EN              RCC_APBENR2_TIM14EN_Msk                /*!< TIM14 clock enable */

#define RCC_APBENR2_ADCEN_Pos            (20U)
#define RCC_APBENR2_ADCEN_Msk            (0x1UL << RCC_APBENR2_ADCEN_Pos)       /*!< 0x00100000 */
#define RCC_APBENR2_ADCEN                RCC_APBENR2_ADCEN_Msk                  /*!< ADC clock enable */

#define RCC_APBENR2_COMP1EN_Pos          (21U)
#define RCC_APBENR2_COMP1EN_Msk          (0x1UL << RCC_APBENR2_COMP1EN_Pos)     /*!< 0x00200000 */
#define RCC_APBENR2_COMP1EN              RCC_APBENR2_COMP1EN_Msk                /*!< COMP1 clock enable */

#define RCC_APBENR2_COMP2EN_Pos          (22U)
#define RCC_APBENR2_COMP2EN_Msk          (0x1UL << RCC_APBENR2_COMP2EN_Pos)     /*!< 0x00400000 */
#define RCC_APBENR2_COMP2EN              RCC_APBENR2_COMP2EN_Msk                /*!< COMP2 clock enable */

#define RCC_APBENR2_TKEN_Pos             (25U)
#define RCC_APBENR2_TKEN_Msk             (0x1UL << RCC_APBENR2_TKEN_Pos)        /*!< 0x02000000 */
#define RCC_APBENR2_TKEN                 RCC_APBENR2_TKEN_Msk                   /*!< TK clock enable */

/********************  Bit definition for RCC_CCIPR register  ******************/
#define RCC_CCIPR_TIMCLK_CTRL_Pos        (0U)
#define RCC_CCIPR_TIMCLK_CTRL_Msk        (0x1UL << RCC_CCIPR_TIMCLK_CTRL_Pos)   /*!< 0x00000001 */
#define RCC_CCIPR_TIMCLK_CTRL            RCC_CCIPR_TIMCLK_CTRL_Msk              /*!< Timer PCLK control  */

#define RCC_CCIPR_COMP1SEL_Pos           (8U)
#define RCC_CCIPR_COMP1SEL_Msk           (0x1UL << RCC_CCIPR_COMP1SEL_Pos)      /*!< 0x00000100 */
#define RCC_CCIPR_COMP1SEL               RCC_CCIPR_COMP1SEL_Msk                 /*!< COMP1 clock select */

#define RCC_CCIPR_COMP2SEL_Pos           (9U)
#define RCC_CCIPR_COMP2SEL_Msk           (0x1UL << RCC_CCIPR_COMP2SEL_Pos)      /*!< 0x00000200 */
#define RCC_CCIPR_COMP2SEL               RCC_CCIPR_COMP2SEL_Msk                 /*!< COMP2 clock select */

#define RCC_CCIPR_IWDGSEL_Pos            (12U)
#define RCC_CCIPR_IWDGSEL_Msk            (0x1UL << RCC_CCIPR_IWDGSEL_Pos)       /*!< 0x00001000 */
#define RCC_CCIPR_IWDGSEL                RCC_CCIPR_IWDGSEL_Msk                  /*!< IWDG clock select */

#define RCC_CCIPR_ADC_CKMODE_Pos         (20U)
#define RCC_CCIPR_ADC_CKMODE_Msk         (0xFUL << RCC_CCIPR_ADC_CKMODE_Pos)    /*!< 0x000F0000 */
#define RCC_CCIPR_ADC_CKMODE             RCC_CCIPR_ADC_CKMODE_Msk               /*!< ADC clock mode select */
#define RCC_CCIPR_ADC_CKMODE_0           (0x1UL << RCC_CCIPR_ADC_CKMODE_Pos)    /*!< 0x00010000 */
#define RCC_CCIPR_ADC_CKMODE_1           (0x2UL << RCC_CCIPR_ADC_CKMODE_Pos)    /*!< 0x00020000 */
#define RCC_CCIPR_ADC_CKMODE_2           (0x4UL << RCC_CCIPR_ADC_CKMODE_Pos)    /*!< 0x00040000 */
#define RCC_CCIPR_ADC_CKMODE_3           (0x8UL << RCC_CCIPR_ADC_CKMODE_Pos)    /*!< 0x00080000 */

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos               (0U)
#define RCC_BDCR_LSEON_Msk               (0x1UL << RCC_BDCR_LSEON_Pos)          /*!< 0x00000001 */
#define RCC_BDCR_LSEON                   RCC_BDCR_LSEON_Msk                     /*!< LSE enable */

#define RCC_BDCR_LSERDY_Pos              (1U)
#define RCC_BDCR_LSERDY_Msk              (0x1UL << RCC_BDCR_LSERDY_Pos)         /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                  RCC_BDCR_LSERDY_Msk                    /*!< LSE ready */

#define RCC_BDCR_LSEBYP_Pos              (2U)
#define RCC_BDCR_LSEBYP_Msk              (0x1UL << RCC_BDCR_LSEBYP_Pos)         /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                  RCC_BDCR_LSEBYP_Msk                    /*!< LSE bypass */

#define RCC_BDCR_LSECSSON_Pos            (5U)
#define RCC_BDCR_LSECSSON_Msk            (0x1UL << RCC_BDCR_LSECSSON_Pos)       /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON                RCC_BDCR_LSECSSON_Msk                  /*!< LSE CSS enable */

