OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020x6.h
#define TK_STR2_SIDACTIME_Pos               (16U)
#define TK_STR2_SIDACTIME_Msk               (0x1FUL << TK_STR2_SIDACTIME_Pos)       /*!< 0x001F0000 */
#define TK_STR2_SIDACTIME                   TK_STR2_SIDACTIME_Msk  
#define TK_STR2_SIDACTIME_0                 (0x1UL << TK_STR2_SIDACTIME_Pos)        /*!< 0x00010000 */
#define TK_STR2_SIDACTIME_1                 (0x2UL << TK_STR2_SIDACTIME_Pos)        /*!< 0x00020000 */
#define TK_STR2_SIDACTIME_2                 (0x4UL << TK_STR2_SIDACTIME_Pos)        /*!< 0x00040000 */
#define TK_STR2_SIDACTIME_3                 (0x8UL << TK_STR2_SIDACTIME_Pos)        /*!< 0x00080000 */
#define TK_STR2_SIDACTIME_4                 (0x10UL << TK_STR2_SIDACTIME_Pos)       /*!< 0x00100000 */

#define TK_STR2_BEFORE_SW_TIME_Pos          (24U)
#define TK_STR2_BEFORE_SW_TIME_Msk          (0xFUL << TK_STR2_BEFORE_SW_TIME_Pos)   /*!< 0x0F000000 */
#define TK_STR2_BEFORE_SW_TIME              TK_STR2_BEFORE_SW_TIME_Msk     
#define TK_STR2_BEFORE_SW_TIME_0            (0x1UL << TK_STR2_BEFORE_SW_TIME_Pos)   /*!< 0x01000000 */
#define TK_STR2_BEFORE_SW_TIME_1            (0x2UL << TK_STR2_BEFORE_SW_TIME_Pos)   /*!< 0x02000000 */
#define TK_STR2_BEFORE_SW_TIME_2            (0x4UL << TK_STR2_BEFORE_SW_TIME_Pos)   /*!< 0x04000000 */
#define TK_STR2_BEFORE_SW_TIME_3            (0x8UL << TK_STR2_BEFORE_SW_TIME_Pos)   /*!< 0x08000000 */

#define TK_STR2_CHRG_SIDAEN_TIME_Pos        (28U)
#define TK_STR2_CHRG_SIDAEN_TIME_Msk        (0x3UL << TK_STR2_CHRG_SIDAEN_TIME_Pos) /*!< 0x30000000 */
#define TK_STR2_CHRG_SIDAEN_TIME            TK_STR2_CHRG_SIDAEN_TIME_Msk   
#define TK_STR2_CHRG_SIDAEN_TIME_0          (0x1UL << TK_STR2_CHRG_SIDAEN_TIME_Pos) /*!< 0x10000000 */
#define TK_STR2_CHRG_SIDAEN_TIME_1          (0x2UL << TK_STR2_CHRG_SIDAEN_TIME_Pos) /*!< 0x20000000 */

/*******************  Bit definition for TK_WR register  ********************/
#define TK_WR_WIN_Pos                       (0U)
#define TK_WR_WIN_Msk                       (0xFFFFUL << TK_WR_WIN_Pos)             /*!< 0x0000FFFF */
#define TK_WR_WIN                           TK_WR_WIN_Msk                           

/*******************  Bit definition for TK_SDR register  ********************/
#define TK_SDR_SWDIV_Pos                    (0U)
#define TK_SDR_SWDIV_Msk                    (0x1FFUL << TK_SDR_SWDIV_Pos)           /*!< 0x000001FF */
#define TK_SDR_SWDIV                        TK_SDR_SWDIV_Msk                        
#define TK_SDR_SWDIV_0                      (0x1UL << TK_SDR_SWDIV_Pos)             /*!< 0x00000001 */
#define TK_SDR_SWDIV_1                      (0x2UL << TK_SDR_SWDIV_Pos)             /*!< 0x00000002 */
#define TK_SDR_SWDIV_2                      (0x4UL << TK_SDR_SWDIV_Pos)             /*!< 0x00000004 */
#define TK_SDR_SWDIV_3                      (0x8UL << TK_SDR_SWDIV_Pos)             /*!< 0x00000008 */
#define TK_SDR_SWDIV_4                      (0x10UL << TK_SDR_SWDIV_Pos)            /*!< 0x00000010 */
#define TK_SDR_SWDIV_5                      (0x20UL << TK_SDR_SWDIV_Pos)            /*!< 0x00000020 */
#define TK_SDR_SWDIV_6                      (0x40UL << TK_SDR_SWDIV_Pos)            /*!< 0x00000040 */
#define TK_SDR_SWDIV_7                      (0x80UL << TK_SDR_SWDIV_Pos)            /*!< 0x00000080 */
#define TK_SDR_SWDIV_8                      (0x100UL << TK_SDR_SWDIV_Pos)           /*!< 0x00000100 */

/*******************  Bit definition for TK_PRSR register  ********************/
#define TK_PRSR_LFSRP_Pos                   (0U)
#define TK_PRSR_LFSRP_Msk                   (0xFFFFUL << TK_PRSR_LFSRP_Pos)         /*!< 0x0000FFFF */
#define TK_PRSR_LFSRP                       TK_PRSR_LFSRP_Msk                       

#define TK_PRSR_SEED_Pos                    (16U)
#define TK_PRSR_SEED_Msk                    (0xFFFFUL << TK_PRSR_SEED_Pos)          /*!< 0xFFFF0000 */
#define TK_PRSR_SEED                        TK_PRSR_SEED_Msk                        

/*******************  Bit definition for TK_DR register  ********************/
#define TK_DR_DATA_Pos                      (0U)
#define TK_DR_DATA_Msk                      (0xFFFFUL << TK_DR_DATA_Pos)            /*!< 0x0000FFFF */
#define TK_DR_DATA                          TK_DR_DATA_Msk                          

/*******************  Bit definition for TK_SR register  ********************/
#define TK_SR_SENSEDONE_Pos                 (0U)
#define TK_SR_SENSEDONE_Msk                 (0x1UL << TK_SR_SENSEDONE_Pos)          /*!< 0x00000001 */
#define TK_SR_SENSEDONE                     TK_SR_SENSEDONE_Msk                    

#define TK_SR_CMPOUT_Pos                    (1U)
#define TK_SR_CMPOUT_Msk                    (0x1UL << TK_SR_CMPOUT_Pos)             /*!< 0x00000002 */
#define TK_SR_CMPOUT                        TK_SR_CMPOUT_Msk                        

#define TK_SR_SHORTSWERR_Pos                (2U)
#define TK_SR_SHORTSWERR_Msk                (0x1UL << TK_SR_SHORTSWERR_Pos)         /*!< 0x00000004 */
#define TK_SR_SHORTSWERR                    TK_SR_SHORTSWERR_Msk                        

/*******************  Bit definition for TK_IER register  ********************/
#define TK_IER_EVTINTEN_Pos                 (0U)
#define TK_IER_EVTINTEN_Msk                 (0x1UL << TK_IER_EVTINTEN_Pos)          /*!< 0x00000001 */
#define TK_IER_EVTINTEN                     TK_IER_EVTINTEN_Msk                        

#define TK_IER_ERRINTEN_Pos                 (1U)
#define TK_IER_ERRINTEN_Msk                 (0x1UL << TK_IER_ERRINTEN_Pos)          /*!< 0x00000002 */
#define TK_IER_ERRINTEN                     TK_IER_ERRINTEN_Msk         

/*******************  Bit definition for TK_ICR register  ********************/
#define TK_ICR_EVTINTCLR_Pos                (0U)
#define TK_ICR_EVTINTCLR_Msk                (0x1UL << TK_ICR_EVTINTCLR_Pos)         /*!< 0x00000001 */
#define TK_ICR_EVTINTCLR                    TK_ICR_EVTINTCLR_Msk                       

#define TK_ICR_ERRINTCLR_Pos                (1U)
#define TK_ICR_ERRINTCLR_Msk                (0x1UL << TK_ICR_ERRINTCLR_Pos)         /*!< 0x00000002 */
#define TK_ICR_ERRINTCLR                    TK_ICR_ERRINTCLR_Msk

